//p430~432 요약
/*
웹 소켓은 HTML5에서 새로 추가된 스펙으로 실시간 양방향 데이터 전송을 위한 기술...
HTTP와 다르게 WS라는 프로토콜을 사용,. .
웹 소켓이 나오기 이전에는 HTTP기술을 사용하여 실시간 데이터 전송을 구현.
그중 한가지가 폴링(polling): HTTP가 클라이언트에서 서버로 향하는 단방향 통신이므로 주기적으로 서버에 새로운 업데이트가 없는지 확인하는 요청을 보냄.
HTML5가 나오면서 웹 소켓으로 웹 브라우저와 웹 서버가 지속적으로 연결된 라인을 통해 실시간으로 데이터를 주고받기 가능:
처음에 웹 소켓 연결이 이루어지고 나면 그 다음부터는 계속 연결된 상태로 있어 따로 업데이트가 있는지 요청 보낼 필요 없음.
HTTP프로토콜과 포트를 공유할 수 있으므로 다른 포트에 연결할 필요도 없음. 폴링 방식에 비해 성능도 개선.

참고:
server sent events 는 EventSrouce라는 객체를 사용. 처음에 한 번만 연결하면 서버가 클라이언트에 지속적으로 데이터를 보냄.
서버에서 클라이언트로 데이터를 보내는 단방향 통신 
*/